test/fixtures/invoice_post_response.json

{"id":"e2311678dccd78c1daa19134e7fc9a75","order_id":"672ea1ede7b991935520883b30ee4ac5","amount_cents":100,"currency":"USD","status":"pending","issue_on_create":false,"created_at":"2018-05-28T15:19:59-05:00","opened_at":null,"issued_at":null,"due_at":null,"final_state_at":null,"merchant_notes":null,"merchant_invoice_id":null,"tax_cents":null,"shipping_cents":null,"amount_due":100,"links":{"self":"https://test.apruve.com/api/v4/invoices/f2311578dccd78c1dda19134e7fc9a75","order":"https://test.apruve.com/api/v4/orders/572ea1ede7b991935520883b30ee4ac5"},"payments":[],"invoice_items":[{"id":"b6f44b579bc33c5f8f12e7436d54a94c","invoice_id":"f2311578dccd78c1dda19134e7fc9a75","order_id":"572ea1ede7b991935520883b30ee4ac5","title":"foo","description":"desc","quantity":1,"price_ea_cents":100,"price_total_cents":100,"currency":null,"product_url":"https://example.com/","product_image_url":null,"variant_info":null,"vendor":"some vendor","sku":null,"merchant_notes":null,"links":{"self":"https://test.apruve.com/api/v4/invoices/f2311578dccd78c1dda19134e7fc9a75/invoice_items/19293","order":"https://test.apruve.com/api/v4/orders/572ea1ede7b991935520883b30ee4ac5","invoice":"https://test.apruve.com/api/v4/invoices/f2311578dccd78c1dda19134e7fc9a75"}}]}
